Revit 2027 API
OptionalFunctionalityUtils.IsMaterialLibraryAvailable Method
 Checks whether the Material Library is available in the installed Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsMaterialLibraryAvailable()
Public Shared Function IsMaterialLibraryAvailable As Boolean
public:
static bool IsMaterialLibraryAvailable()
static member IsMaterialLibraryAvailable : unit -> bool
Return Value
Boolean
 True if the Material Library is available in the installed Revit.
See Also
Reference
OptionalFunctionalityUtils Class
Autodesk.Revit.DB Namespace